fix env and readme
